; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph2 - mode
	thermograph6 - mode
	spectrograph4 - mode
	image5 - mode
	thermograph1 - mode
	infrared0 - mode
	thermograph3 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star4 - direction
	Star3 - direction
	Star2 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 thermograph6)
	(supports instrument1 thermograph3)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument2 thermograph6)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star2)
	(supports instrument3 infrared0)
	(supports instrument3 image5)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
)
(:goal (and
	(pointing satellite1 Star2)
	(have_image Phenomenon5 spectrograph2)
	(have_image Star6 thermograph6)
	(have_image Phenomenon7 spectrograph4)
	(have_image Planet8 thermograph1)
	(have_image Planet9 thermograph3)
	(have_image Planet9 thermograph6)
	(have_image Phenomenon10 image5)
	(have_image Phenomenon10 infrared0)
	(have_image Planet11 infrared0)
	(have_image Phenomenon12 infrared0)
	(have_image Phenomenon12 thermograph6)
))

)

; plan
1. (turn_to satellite2 star2 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star2)
   goals met: 0 of 12
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 12
3. (calibrate satellite2 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 0 of 12
4. (turn_to satellite2 planet8 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet8)
   goals met: 0 of 12
5. (take_image satellite2 planet8 instrument2 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 1 of 12
6. (turn_to satellite2 phenomenon7 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 phenomenon7)
   goals met: 1 of 12
7. (turn_to satellite1 star3 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star3)
   goals met: 1 of 12
8. (take_image satellite2 phenomenon7 instrument2 spectrograph4)
   added: (have_image phenomenon7 spectrograph4)
   goals met: 2 of 12
9. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 12
10. (switch_off instrument2 satellite2)
   deleted: (power_on instrument2)
   added: (power_avail satellite2)
   goals met: 2 of 12
11. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 2 of 12
12. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 2 of 12
13. (turn_to satellite1 phenomenon12 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 12
14. (take_image satellite1 phenomenon12 instrument1 thermograph6)
   added: (have_image phenomenon12 thermograph6)
   goals met: 3 of 12
15. (turn_to satellite1 phenomenon5 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon5)
   goals met: 3 of 12
16. (take_image satellite1 phenomenon5 instrument1 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 4 of 12
17. (turn_to satellite1 planet9 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet9)
   goals met: 4 of 12
18. (take_image satellite1 planet9 instrument1 thermograph3)
   added: (have_image planet9 thermograph3)
   goals met: 5 of 12
19. (take_image satellite1 planet9 instrument1 thermograph6)
   added: (have_image planet9 thermograph6)
   goals met: 6 of 12
20. (turn_to satellite1 star6 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star6)
   goals met: 6 of 12
21. (take_image satellite1 star6 instrument1 thermograph6)
   added: (have_image star6 thermograph6)
   goals met: 7 of 12
22. (turn_to satellite1 star2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star2)
   goals met: 8 of 12
23. (turn_to satellite2 star2 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star2)
   goals met: 8 of 12
24. (calibrate satellite2 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 8 of 12
25. (turn_to satellite2 phenomenon10 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon10)
   goals met: 8 of 12
26. (take_image satellite2 phenomenon10 instrument3 image5)
   added: (have_image phenomenon10 image5)
   goals met: 9 of 12
27. (take_image satellite2 phenomenon10 instrument3 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 10 of 12
28. (turn_to satellite2 phenomenon12 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon12)
   goals met: 10 of 12
29. (take_image satellite2 phenomenon12 instrument3 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 11 of 12
30. (turn_to satellite2 planet11 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 planet11)
   goals met: 11 of 12
31. (take_image satellite2 planet11 instrument3 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 12 of 12
